
class Msg:
    bot_username = "TheReasonBot"
    need_permissions = "יש לאפשר הרשאות לחסימת משתמשים ולמחיקת הודעות!"
    need_reason = "יש לספק סיבת חסימה. לפרטים נוספים שלחו `/help` ברובוט."
    only_admins = "פעולה זו נתונה לשימוש מנהלי הקבוצה בלבד"
    need_id = "יש לספק מזהה (ID) משתמש. את המזהה תוכלו להשיג באמצעות הבוט @GetTelegramIDbot"
    not_found = "לא קיים מידע על המשתמש במסד הנתונים"
    unblock_btn = "לשחרור החסימה"
    unblock_success = "החסימה שוחררה בהצלחה. המשתמש כעת יכול להיכנס אל הקבוצה!"
    not_found_bans_for_user = "אינך חסום (בינתיים) באף קבוצה. כל הכבוד :)"
    hide_sender = "משתמש זה חסם אפשרות "
    exit_btn = "סגור הודעה"
    head_msg = "רשימת קבוצות חסומות:\n"
    ban_success = "משתמש {} הוסר בהצלחה מהקבוצה."
    add_to_group = "הוסף אותי לקבוצה"
    another_admin = "לא ניתן להשתמש בפקודה זו על מנהלים אחרים"


def return_reason(reason: dict) -> str:
    """ check template for group """
    txt = f"**מזהה משתמש: {reason['user_id']}**\n" \
          f"נחסם בתאריך: {reason['date']}\n" \
          f'ע"י מנהל: [{reason["admin_name"]}](tg://user?id={reason["admin_id"]})\n' \
          f'סיבת החסימה: {reason["reason"]}.'
    return txt


def get_bans_for_user(reason: dict) -> str:
    """ check template for user """
    txt = f"קבוצה: {reason['chat_title']}\n" \
          f"תאריך: {reason['date']}\n" \
          f"סיבת החסימה: {reason['reason']}"
    return txt

start_msg = '''היי {} [👋](robottrick.github.io)

רובוט זה מאפשר למנהלים להסיר משתמשים מהקבוצה ולהצמיד סיבה להסרה על מנת שלאחר מכן שאר המנהלים בקבוצה יוכלו לבדוק את הפרטים על ההסרה.

כמו כן, על ידי בוט זה תוכלו לבדוק האם שמורות במאגר שלנו קבוצות שנחסמתם בהם ואת סיבות החסימה.

לפרטים נוספים ומידע על השימוש, תוכלו למצוא ע"י שליחת הפקודה /help.

בוט זה נוצר ע"י [YeudaBy](t.me/m100achuzBots) && [David-Lev](davidlev.me) מצוות [רובוטריק](https://robottrick.github.io/).'''

help_msg = '''**📄 הוראות שימוש בבוט:**

--• הוסיפו את הבוט לקבוצתכם כמנהל עם הרשאות למחיקת הודעות ולחסימת משתמשים.--
כשתרצו להסיר משתמש השתמשו בפקודה הבאה בתוך הקבוצה:

`/ban < username > < reason >`

ולדוגמה:
`/ban @davidlev מציק למשתמשים`
מכיוון שהפקודה נעשית בקבוצה, ניתן גם לתייג משתמשים שאין להם שם משתמש.
 
--• לבדיקת סיבת החסימה על משתמש שלחו את הפקודה הבאה בקבוצה:--
`/check < user-id >`
ולדוגמה:
`/check 279620118`
או העבירו הודעה מהמשתמש אל הקבוצה והגיבו עליה עם הפקודה /check.

{מכיוון שבהגדרות הפרטיות בטלגרם ניתן להסתיר את האפשרות להעברת הודעות עם קרדיט, מומלץ להשתמש בבדיקה על ידי ID. המשתמש יוכל לקבל את ה-ID שלו באמצעות [הבוט שלנו](http://t.me/GetTelegramIDbot).}

לאחר שליחת הפקודה תוצג בפניכם תאריך וסיבת ההסרה, שם המנהל שהסיר, וכן אפשרות לבטל את החסימה.

--• משתמשים יכולים לבדוק את הקבוצות שבהן הם חסומים ע"י כניסה לבוט ושליחת הפקודה /my_bans.--
משתמש מקבל את המידע הבא: הקבוצות בהן הוא חסום, תאריך וסיבות החסימות. המשתמש אינו מקבל את שם המנהל שחסם אותו.

🖤 הרובוט כרגיל [בקוד פתוח](http://github.com/RobotTrick/TheReasonBot) בגיטהאב :)'''